#+TITLE: Elisp Intro

** storing text in list
The function =cons= can be used to construct a new list, such as

#+BEGIN_SRC emacs-lisp
(cons "another piece"
      '("a piece of text" "previous piece"))
#+END_SRC

#+RESULTS:
| another piece | a piece of text | previous piece |

#+BEGIN_SRC emacs-lisp
(car (nthcdr 1 '("another piece"
                 "a piece of text"
                 "more text to read")))
#+END_SRC

#+RESULTS:
: a piece of text

